<template>
Соединительные кабели
<br>


Функции физического уровня<br>
Физический уровень определяет способ физического соединения компьютеров в сети. Основными функциями средств, относящихся к данному уровню, является побитовое преобразование цифровых данных в сигналы среды передачи, а также собственно передача сигналов по физической среде.
<br>
Среда передачи<br>
Центральным понятием данного уровня является понятие среды передачи. Среда передачи – это физическая среда, по которой возможно распространение информационных сигналов в виде электрических, световых и т.п. импульсов. В настоящее время выделяют два основных типа физических соединений: соединения с помощью кабеля и беспроводные соединения.
<br>
Технические характеристики среды передачи влияют на такие потребительские параметры сетей как максимальное расстояние передачи данных и максимальная скорость передачи данных.
<br>
Кабельные системы<br>
<br>
Кабель (cable), используемый для построения компьютерных сетей, представляет собой сложную конструкцию, состоящую, в общем случае, из проводников, изолирующих и экранирующих слоев. В современных сетях используются три типа кабеля:
<br>
коаксиальный кабель (coaxial cable);<br>
"витая пара" (twisted pair);<br>
оптоволоконный кабель (fiber optic).<br>
Каждый тип кабеля отличается от других внутренним устройством и обладает целым набором технических характеристик, влияющих на основные потребительские параметры сетей:
<br>
Тип кабеля
<br>
Характеристика
<br>
Максимальное расстояние передачи
<br>
Максимальная скорость передачи
<br>
Коаксиальный кабель
<br>
185 – 500 м
<br>
10 Мбит/с
<br>
"Витая пара"
<br>
30 – 100 м
<br>
10 Мбит/с – 1 Гбит/с
<br>
Оптоволоконный кабель
<br>
2 км
<br>
10 Мбит/с – 2 Гбит/с
<br>
Коаксиальный кабель
<br>
Коаксиальный кабель был первым типом кабеля, использованным для соединения компьютеров в сеть. Кабель данного типа состоит из центрального медного проводника, покрытого пластиковым изолирующим материалом, который, в свою очередь, окружен медной сеткой и/или алюминиевой фольгой. Этот внешний проводник обеспечивает заземление и защиту центрального проводника от внешней электромагнитной интерференции. При прокладке сетей используются два типа кабеля — "Толстый коаксиальный кабель" (Thicknet) и "Тонкий коаксиальный кабель" (Thinnet). Сети на основе коаксиального кабеля обеспечивают передачу со скоростью до 10 Мбит/с. Максимальная длина сегмента лежит в диапазоне от 185 до 500 м в зависимости от типа кабеля.

<br>


Устройство коаксиального кабеля
<br>
 

"Витая пара"
<br>
Кабель типа "витая пара" (twisted pair), является одним из наиболее распространенных типов кабеля в настоящее время. Он состоит из нескольких пар медных проводов, покрытых пластиковой оболочкой. Провода, составляющие каждую пару, закручены вокруг друг друга, что обеспечивает защиту от взаимных наводок. Кабели данного типа делятся на два класса — "экранированная витая пара" ("Shielded twisted pair") и "неэкранированная витая пара" ("Unshielded twisted pair"). Отличие этих классов состоит в том, что экранированная витая пара является более защищенной от внешней электромагнитной интерференции, благодаря наличию дополнительного экрана из медной сетки и/или алюминиевой фольги, окружающего провода кабеля. Сети на основе "витой пары" в зависимости от категории кабеля обеспечивают передачу со скоростью от 10 Мбит/с – 1 Гбит/с. Длина сегмента кабеля не может превышать 100 м (до 100 Мбит/с) или 30 м (1 Гбит/с).
<br>
Устройство кабеля типа "витая пара”

<br>
Оптоволоконный кабель<br>
Оптоволоконные кабели представляют собой наиболее современную кабельную технологию, обеспечивающую высокую скорость передачи данных на большие расстояния, устойчивую к интерференции и прослушиванию. Оптоволоконный кабель состоит из центрального стеклянного или пластикового проводника, окруженного слоем стеклянного или пластикового покрытия и внешней защитной оболочкой. Передача данных осуществляется с помощью лазерного или светодиодного передатчика, посылающего однонаправленные световые импульсы через центральный проводник. Сигнал на другом конце принимается фотодиодным приемником, осуществляющим преобразование световых импульсов в электрические сигналы, которые могут обрабатываться компьютером. Скорость передачи для оптоволоконных сетей находится в диапазоне от 100 Мбит/c до 2 Гбит/с. Ограничение по длине сегмента составляет 2 км.

<br>

Устройство оптоволоконного кабеля
<br>
Беспроводные технологии
<br>
Беспроводные технологии используют в качестве среды электромагнитные волны.
<br>
Основой классификации беспроводных технологий передачи данных является разделение спектра электромагнитного излучения на диапазоны частот. Особо выделяют два диапазона: радиоизлучение в коротковолновом (КВ) и ультракоротковолновом (УКВ) диапазоне (от 3-30 МГц до 300-6000ГГц) и инфракрасное излучение (50 – 400 ТГц).
<br>
В соответствии с тем, к какому диапазону относятся электромагнитные волны, используемые для передачи данных, сети разделяют на два типа:
<br>
радиосети (как наземные, так и спутниковые);<br>
инфракрасные сети.<br>
Частотные характеристики электромагнитных волн влияют на основные характеристики сети:
<br>
Диапазон частот, на которых осуществляется передача
<br>
Характеристика
<br>
Максимальное расстояние передачи
<br>
Максимальная скорость передачи
<br>
КВ-диапазон (3-30 МГц)
<br>
до неск. тыс. км
<br>
До 6 Кбит/с
<br>
УКВ-диапазон (100 – 512 МГц)
<br>
70 – 50 км
<br>
10 – 128 Кбит/с
<br>
УКВ-диапазон (900 МГц-2,5 ГГц)
<br>
250 м – 20 км
<br>
2 - 10 Мбит/с
<br>
Инфракрасные волны (300-400 ТГц)
<br>
30 м – 1 км
<br>
20 – 622 Мбит/с

<br>

Сравнение кабельных и беспроводных сетей<br>
Беспроводные сети имеют ряд преимуществ по сравнению с кабельными сетями:<br>

мобильность: абоненты, подключенные к беспроводной сети, имеют возможность перемещаться во время работы;<br>
универсальность: возможность развертывания сети там, где прокладка кабеля может оказаться слишком дорогой или вообще невозможной;<br>
срочность: скорость развертывания беспроводной сети достаточно высока, поскольку не тратится время на прокладку кабеля.<br>
К недостаткам беспроводных сетей по сравнению с кабельными следует отнести:
<br>
зависимость качества связи от природных явлений (например, грозы) и погодных условий (например, туман является помехой для передачи в инфракрасном диапазоне);<br>
для высокочастотных технологий необходимость расположения приемника и передатчика в прямой видимости;<br>
возможность возникновения конфликтов с другими беспроводными средствами связи (например, сотовая телефония).<br>
 

Топология сети<br>
Еще одним важным понятием физического уровня является способ соединения компьютеров с помощью физической среды или топология сети. Если сеть состоит всего из двух компьютеров, то они соединяются "напрямую". Такой способ соединения получил название "точка-точка" ("point-to-point").
<br>
Соединение типа "точка-точка
<br>
 

Для обеспечения связи более чем двух компьютеров может использоваться последовательность соединений типа "точка-точка".<br>

 

Последовательность соединений типа "точка-точка"<br>

Однако такой подход требует установки на большую часть компьютеров нескольких устройств передачи данных.
<br>
В качестве альтернативного подхода возможно использование более сложных топологий, позволяющих подключить к общей среде сразу несколько компьютеров, имеющих по одному устройству передачи данных. Выделяют три базовые топологии: "Шина" ("bus"), "Кольцо" ("ring"), "Звезда"("star").
<br>
Топология “Шина”<br>
Топология "Шина"<br>

Эта топология использует один передающий канал на базе коаксиального кабеля, называемый "шиной". Все сетевые компьютеры присоединяются напрямую к шине. На концах кабеля-шины устанавливаются специальные заглушки - "терминаторы" (terminator). Они необходимы для того, чтобы погасить сигнал после прохождения по шине. К недостаткам топологии "Шина" следует отнести следующее:
<br>
данные, предаваемые по кабелю, доступны всем подключенным компьютерам;<br>
в случае повреждения "шины" вся сеть перестает функционировать.<br>
 
Топология “Кольцо”<br>
Топология "Кольцо<br>

Для топологии кольцо характерно отсутствие конечных точек соединения; сеть замкнута, образуя неразрывное кольцо, по которому передаются данные. Эта топология подразумевает следующий механизм передачи: данные передаются последовательно от одного компьютера к другому, пока не достигнут компьютера-получателя. Недостатки топологии "кольцо" те же, то и у топологии "шина":
<br>
общедоступность данных;<br>
неустойчивость к повреждениям кабельной системы.<br>
 
Топология “Звезда”<br>
Топология "Звезда"<br>

В сети с топологией "звезда" все компьютеры соединены со специальным устройством, называемым сетевым концентратором или "хабом" (hub), который выполняет функции распределения данных. Прямые соединения двух компьютеров в сети отсутствуют. Благодаря этому, имеется возможность решения проблемы общедоступности данных, а также повышается устойчивость к повреждениям кабельной системы. Однако функциональность сети зависит от состояния сетевого концентратора.
<br>
Физическая и логическая топологии<br>
Следует отметить, что термин топология может употребляться для обозначения двух понятий – физической топологии и логической топологии. Физическая топология – способ физического соединения компьютеров с помощью среды передачи, например, участками кабеля.
<br>
Логическая топология определяет маршруты передачи данных в сети. Во многих случаях, физическая топология однозначно определяет логическую топологию. Однако существуют такие конфигурации, в которых логическая топология отличается от физической. Например, сеть с физической топологией “звезда” может иметь логическую топологию “шина” – все зависит от того, каким образом устроен сетевой концентратор.

</template>



<script>
  import { ref, onMounted } from 'vue'
  import { useRouter } from 'vue-router';

export default {
   name: 'ConnectingCables',
   setup(){
      const router = useRouter();
  
        function navigate(path, tren) {
          router.push({
            path: path, 
            params: {typeTren: tren}
            })
        }
  
  
  
      return {
        navigate
      }
     }
}

</script>
     