<template>
    Язык HTML – язык разметки гипертекста.
    <br>
Гипертекст – документ, содержащий ссылки на другие документы.
<br>
HTML был разработан для того, чтобы, создавая документ, можно <br>
было не думать о различии в программном и аппаратном <br>
обеспечении компьютеров, на которых этот документ будет <br>
просматриваться. Именно создание системно-независимых файлов <br>
очень актуально, ибо компьютерная сеть объединяет принципиально <br>
разные компьютерные системы – такие как Macintosh, IBM и др.
<br>
При создании документа делается акцент на его структуре. <br>
Например: любой текстовый редактор концентрирует внимание на внешнем <br>
виде документа. Возможность создания документа, который может быть <br>
просмотрен на любом компьютере, большой шаг вперёд по сравнению с <br>
использованием таких текстовых редакторов, как, например, MS Word.
<br>
HTML определяет формат представления информации, при использовании <br>
которого не нужно будет о форматировании текста, а можно полностью <br>
сосредоточиться на его содержании. HTML очень прост в использовании, <br>
но требует от работающего с ним человека мышления в пределах строгих правил.
<br>
Язык HTML состоит из специальных разметочных указателей, иногда <br>
их называют флаги разметки, но чаще – теги. Можно их также <br>
называть командами или кодами языка HTML.
<br>
Тег – инструкция браузеру, указывающая способ отображения текста.
<br>
Существуют два типа тегов – парные и непарные. Парный тег влияет <br>
на текст с того места, где употреблён, до того места, где указан <br>
признак окончания его действия, а им служит тот же самый тег, <br>
только начинающийся с символа слэш "/".
<br>
Кроме того, теги делятся на категории по выполняемым ими <br>
функциям – структурные теги, теги форматирования абзацев, <br>
символов, определения гиперссылок, включения графики и др.
</template>
<script>
  import { ref, onMounted } from 'vue'
  import { useRouter } from 'vue-router';

export default {
   name: 'ArticleDNS',
   setup(){
      const router = useRouter();
  
        function navigate(path, tren) {
          router.push({
            path: path, 
            params: {typeTren: tren}
            })
        }
  
  
  
      return {
        navigate
      }
     }
}

</script>
     