<template>
    Основное назначение сети - совместное использование ресурсов и обеспечение связи между компьютерами в офисе и за его пределами. Локальной сетью называется сеть, расположенная на сравнительно небольшой территории.
<br>
Локальные сети позволяют:
<br>
 хранить информацию на специализированных серверах, что даёт возможность нескольким пользователям работать с одними и теми же данными;
 <br>
 хранить программные средства, используемые несколькими пользователями, в единственном экземпляре на дисках файловых серверов;
 <br>
 обеспечить документооборот и коллективную работу пользователей с использованием средств электронной почты и группового планирования;
 <br>
 совместно использовать сетевые принтеры;
 <br>
 обеспечить доступ к Интернету;
 <br>
 обеспечить централизованную защиту и резервное копирование информации.
 <br>

В последние годы происходит усложнение структуры сетей за счёт создания гетерогенных сетей, объединяющих разные компьютерные платформы.
<br>
Устройства, предназначенные для обслуживания локальной сети, как правило, дороже, но обеспечивают более высокую производительность и лучшие возможности, чем устройства, подключаемые к персональному компьютеру. Различают сетевые устройства для рабочих групп и устройства для сетей масштаба предприятий.
<br>
Работая в сети, вы можете предоставить другим пользователям права доступа к вашим папкам, принтеру и другим периферийным устройствам вашего компьютера и, в свою очередь, получить доступ к ресурсам других компьютеров. Папки, устройства, доступные для нескольких пользователей, работающих в сети, называются совместно используемыми ресурсами. Ресурсы, принадлежащие какому-либо компьютеру и недоступные для других пользователей, называются неразделяемыми (локальными).
</template>
<script>
  import { ref, onMounted } from 'vue'
  import { useRouter } from 'vue-router';

export default {
   name: 'ArticleDNS',
   setup(){
      const router = useRouter();
  
        function navigate(path, tren) {
          router.push({
            path: path, 
            params: {typeTren: tren}
            })
        }
  
  
  
      return {
        navigate
      }
     }
}

</script>
     