<template>
Модемы
<br>
Модем предназначен для модуляции сигналов <br>
на выходе компьютера в сигналы, <br>
которые могут передаваться по телефонной сети, <br>
и демодуляции при приёме информации на компьютер.
<br>

Одно из важнейших характеристик модема является скорость <br>
передачи данных. Скорость передачи данных определяет, какое <br>
количество информации (бит) модем может передавать/принимать <br>
за единицу времени (секунду). Чем выше скорость передачи данных, <br>
тем меньше времени потребуется модему на передачу или приём информации.
<br>
Компании, производящие модемы, иногда обновляют код контроллера <br>
(собственную операционную систему модема), после чего <br>
пользователи могут модернизировать свои устройства. Часто <br>
обновляются и драйверы - программные инструкции, используемые <br>
компьютером для общения с модемом. Как правило, чем новее код <br>
контроллера и драйверы, тем выше производительность.
<br>
Идеальный факс-модем: портрет героя<br>
 работает на коммутируемых, двух- и четырех-проводных выделенных линиях;

 <br>
  предусматривает все стандартные протоколы МСЭ-Т для этих линий <br>
  вплоть до самого последнего на текущий момент (к моменту <br>
  выхода обзора в свет это будет, по-видимому, V.34bis);<br>
  <br>
 имеет "особо цепкий", хотя, быть может, и не сверхскоростной <br>
 фирменный протокол модуляции, удерживающий связь и <br>
 продолжающий "протаскивать" по линии данные при любых <br>
 творящихся в ней "ужасах";
 <br>
 предусматривает все стандартные (и, возможно, нестандартные) <br>
 протоколы коррекции ошибок и сжатия данных;
 <br>
 обеспечивает передачу факсов группы 3 со скоростями <br>
 от 0,3 до 14,4 кбит/с (протокол V.17) и классы <br>
 взаимодействия с программами факсов 1, 2 и 2.0.
 <br>
 предусматривает регулировку уровня передачи в <br>
 широких пределах (от 0 до -20 дБм) не только на <br>
 выделенной, но и на коммутируемой линии;
 <br>

 имеет повышенную чувствительность (более -50 дБм) <br>
 и соответственно помехозащищенность, так как <br>
 повышением уровня передачи далеко не всегда можно <br>
 добиться желаемого эффекта из-за возрастания уровня <br>
 местного эхо-сигнала. К сожалению, все испытывавшиеся <br>
 модемы имели стандартизованную чувствительность -43 дБм;
 <br>
 имеет автоматическую регулировку усиления приемника <br>
 в динамическом диапазоне от 0 до максимальной чувствительности;
 <br>
 "держит" отклонение несущей частоты в более <br>
 широких пределах, чем предусмотренные стандартом 7 Гц;
 <br>
 автоматически набирает заданный номер и <br>
 устанавливать резервное соединение по <br>
 коммутируемой линии при отказе выделенной. При восстановлении <br>
 связи по выделенной линии автоматически возвращается <br>
 на нее, освобождая коммутируемую линию;
 <br>

 имеет дополнительный низкоскоростной (так называемый <br>
 вторичный) канал управления, позволяющий централизованно <br>
 управлять сетью, в которую входит большое количество модемов;
 <br>
 встроенные программы должны храниться в перепрограммируемом <br>
 флэш-ПЗУ, обеспечивающем легкость перехода на новые версии, <br>
 а следовательно, модернизации модема без вскрытия корпуса и <br>
 замены каких-либо компонентов. По этому поводу, кстати, у <br>
 специалистов существует и противоположное мнение: флэш-ПЗУ <br>
 менее надежно, чем обычное масочное программируемое или с <br>
 Уф стиранием - известны прецеденты самопроизвольного стирания <br>
 информации в таких ПЗУ (в этом случае модем полностью теряет работоспособность);
 <br>
 показывает максимально подробную информацию о качестве <br>
 сигнала (уровень, отношение сигнал/шум, отклонение <br>
 несущей частоты, фазовые искажения, уровень местного <br>
 и удаленного эхо-сигналов);
 <br>

 показывает подробную информацию о сеансе связи (скорость <br>
 передачи, несущая, модуляция, параметры протоколов <br>
 коррекции ошибок и сжатия данных, число переданных и <br>
 принятых байт, запросов повторной передачи, повторных <br>
 установлений связи и т. д.);
 <br>
 предусматривает возможность дистанционной настройки и (при<br>
  наличии такого же модема на противоположном конце линии) <br>
  передачи целиком конфигурационных профилей из одного модема в другой;
 <br>
 имеет средства защиты от несанкционированного доступа, <br>
 включающие парольную защиту и обратный звонок по номеру, <br>
 хранящемуся в памяти модема или указанному пользователем;
 <br>
 воспринимает информацию о вызывающем абоненте (CID) и <br>
 различать условные звонки, передаваемые электронными АТС <br>
 последнего поколения. Для России эти требования могут <br>
 показаться чрезмерными и даже экзотическими, но такие <br>
 АТС в Москве уже работают, и их число будет увеличиваться;
 <br>
 определяет номер вызывающего абонента по российскому стандарту (АОН);
 <br>
 использует усовершенствованный алгоритм определения сигналов "занято"<br>
 , надежно распознающий эти сигналы наших АТС по крайней мере в 80% случаев;
 <br>
 имеет экранный справочник по AT-командам и S-регистрам;
 <br>
 имеет плавную ручную регулировку громкости динамика (желательно, <br>
 чтобы это был именно широкополосный динамик, а не пьезоэлектрическая <br>
 "пищалка" омерзительной тональности);
 <br>
 предусматривает (отключаемую) возможность автоматического <br>
 включения динамика для прослушивания линии в процессе <br>
 повторного установления связи ("ретрейна");
 <br>
 имеет информативную индикацию на панели (лучше всего - ЖК-дисплей), <br>
 сообщающую текущую скорость передачи/приема, качество сигнала, <br>
 состояние модема (повторная передача, повторное установление <br>
 связи, тест и др.), наличие коррекции ошибок и сжатия данных;
 <br>
  обладает средствами работы с голосовыми данными.
  <br>
 Информация о том, насколько близок к идеалу каждый из побывавших <br>
 в испытаниях модемов, приведена в таблице врезки "Сводка характеристик".
</template>

 <script>
  import { ref, onMounted } from 'vue'
  import { useRouter } from 'vue-router';

export default {
   name: 'ArticleDNS',
   setup(){
      const router = useRouter();
  
        function navigate(path, tren) {
          router.push({
            path: path, 
            params: {typeTren: tren}
            })
        }
  
  
  
      return {
        navigate
      }
     }
}

</script>
     