<template>
Сетевые адаптеры.
<br>
Для передачи информации по каналам связи необходимо преобразовывать компьютерные сигналы в сигналы физических сред.
<br>
Например, при передаче информации по оптоволоконному кабелю представленные в компьютере данные будут преобразованы в оптические сигналы, для чего используют специальные технические устройства – сетевые адаптеры.
<br>
Сетевые адаптеры – технические устройства, выполняющие функции сопряжения компьютеров с каналами связи.
<br>
Сетевые адаптеры должны соответствовать каналам связи. Для каждого вида канала нужен свой тип сетевого адаптера. Адаптер вставляют в свободное гнездо материнской платы компьютера и соединяют кабелем с сетевым адаптером другого компьютера. На сетевых картах выставляют адреса компьютеров в сети, без которых невозможна передача. Когда информация циркулирует по сети, любой сетевой компьютер отбирает из неё лишь ту, что предназначена именно для него. Определяется она в соответствии с адресом компьютера.
<br>
Существуют также и программные средства, которые выставляют адреса компьютеров. Изобретено немало специальных сетевых систем оболочек. Эти надстройки позволяют определить адреса компьютеров, заказать нужное число пользователей сети, сделать доступными каталоги или аппаратные компьютерам-клиентам в сети, назначив им определённые права, и пр. Программы позволяют защитить информацию. Можно делать одни каталоги доступными только для чтения, другие – для чтения и записи информации, а часть вообще недоступной, невидимой. Тогда пользователям становится доступна лишь часть информации сервера. Сетевые программы дают возможность назначать для разных пользователей различные права доступа. Эта мера бывает необходима для сохранности информации и ограждении её от посторонних глаз.

</template>

<script>
  import { ref, onMounted } from 'vue'
  import { useRouter } from 'vue-router';

export default {
   name: 'ArticleDNS',
   setup(){
      const router = useRouter();
  
        function navigate(path, tren) {
          router.push({
            path: path, 
            params: {typeTren: tren}
            })
        }
  
  
  
      return {
        navigate
      }
     }
}

</script>
     