<template>
Программы работы в сети
<br>
Web-документы хранятся в файлах. Создаются эти файлы с помощью одних программ, а просматриваются с помощью программ просмотра.
<br>
Браузер – программа, служащая для просмотра Web-документов, т.е. обеспечивающая переход на другой объект в соответствии с гиперссылкой.
<br>
Существует много программ-браузеров. У них одна основная функция – обеспечить отображение Web-документов. Но каждая из них предоставляет пользователю разные возможности при работе с этими документами. Например, на маломощных компьютерах до сих пор используются браузеры, которые не способны отображать графику, их так и называют – неграфические браузеры.
<br>
Графические браузеры, как правило, позволяют пользователю включать и выключать рисунки, схемы, фотографии. Такая важная особенность браузера особенно полезна, если передача информации по сети идёт медленно. Не все браузеры позволяют делать так называемые закладки и т.д.
<br>
Кроме того, все браузеры делятся на коммерческие и свободно распространяемые. Покупной браузер отличается тем, что как коммерческий программный продукт сопровождается технической поддержкой, которая бывает очень важна для пользователя.
<br>
Ниже перечислены характерные особенности некоторых браузеров:
<br>
  CERN – неграфический редактор;
  <br>
 NCSA Mosaic – первый, получивший широкое распространение графический браузер, который резко изменил представление об Интернете. Именно эта программа преобразовала Интернет в паутину. Представляет историческую ценность;
 <br>
 Cello – один из самых экономичных браузеров с точки зрения использования ресурсов компьютера;
 <br>
 Netscape Navigator и Microsoft Internet Explorer – наиболее известные и конструктивные браузеры. Они обладают сейчас самыми широкими возможностями при отображении Web-страниц.
</template>

 <script>
  import { ref, onMounted } from 'vue'
  import { useRouter } from 'vue-router';

export default {
   name: 'ArticleDNS',
   setup(){
      const router = useRouter();
  
        function navigate(path, tren) {
          router.push({
            path: path, 
            params: {typeTren: tren}
            })
        }
  
  
  
      return {
        navigate
      }
     }
}

</script>
     