<template>
Серверы
<br>


Сервер – это мощный компьютер в вычислительных сетях, который обеспечивает обслуживание подключённых к нему компьютеров и выход в другие сети.
<br>
На сервере хранятся большие объёмы информации, которыми пользуются подключённые к нему компьютеры. В наши дни это направление компьютерной техники интенсивно развивается.
<br>
Группа серверов насчитывает множество моделей различных уровней мощности. Некоторые из них можно отнести к классу малых машин, другие настолько мощны, что представляют собой суперкомпьютеры. Сервером может быть любой компьютер, оснащённый необходимыми программами и устройствами.
<br>
К серверу предъявляются повышенные требования по быстродействию и надёжности. В нём должно быть предусмотрено резервирование всей хранимой информации. Профилактические и ремонтные работы должны производиться без его остановки и отключения других компьютеров.
<br>
Часто серверы специализируются на обслуживании рабочих станций в какой-то определённой области, например одни из них выделяются для создания и управления базами и архивами данных, другие – для поддержки факсимильной связи и электронной почты, третьи – для управления многопользовательскими принтерами, плоттерами и др.
<br>
В зависимости от назначения выделяют разные типы серверов, например:
<br>
 Сервер приложений, обрабатывает запросы от всех станций вычислительной сети и предоставляет им доступ к общим системным ресурсам;
 <br>
 Файловый сервер, необходим для работы с базами данных;
 <br>
 Архивационный сервер, используется для резервного копирования информации;
 <br>
 Факс сервер – для организации эффективной многоадресной факсимильной связи, с несколькими факсмодемными платами, со специальной защитой информации от несанкционированного доступа в процессе передачи, с системой хранения электронных факсов;
 <br>
 Сервер печати – для эффективного использования системных принтеров;
 <br>
 Сервер телеконференций – компьютер, имеющий программу обслуживания пользователей телеконференциями и новостями.
 <br>

Телекоммуникационная сеть состоит из серверов, передающих между собой информацию по определённым правилам (протоколам), а также отвечающих на обращения компьютеров-абонентов. Для связи серверов сети между собой может использоваться беспроводная спутниковая связь, специально выделенные телефонные линии (служат для прямого соединения абонентов друг с другом, набора номера не требуется), обычные коммутируемые телефонные линии (обеспечивают соединение с тем абонентом, номер которого набран). Для связи абонента с сервером сети, как правило, используется обычная коммутируемая телефонная линия.
<br>

Сервер сети, отвечая на телефонный звонок компьютера абонента, работает в одном из двух режимов: on-line (оператор на линии) или off-line (без оператора). Абонент, используя специальную коммуникативную программу и связываясь через свой компьютер с сервером, работающим в режиме on-line, получает возможность во время сеанса связи давать серверу определённые команды: просмотр радела серверов, получение файлов с сервера на компьютер абонента, передача файлов с компьютера абонента на сервер. Связываясь с сервером, работающим в режиме off-line, абонент не имеет возможности непосредственно работать с сервером: коммуникационная программа абонента автоматически производит обмен информацией с сервером и прекращает сеанс связи. Иначе говоря, процесс ознакомления с полученной информацией в режиме off-line происходит уже тогда, когда связь с сервером уже прекращена. При обмене информацией между собой серверы используют режим off-line.
<br>
Серверы сети обмениваются информацией между собой, поэтому абонент, подключённый к какому-либо одному серверу сети, имеет возможность обмениваться информацией с любым другим абонентом, подключённым к сети. Так как большинство сетей имеет между собой шлюзы (средства обмена информацией между серверами различных сетей) и тем самым входят в мировое содружество сетей, абонент одной какой-либо сети, в принципе получает возможность обмениваться информацией с любым другим абонентом, подключённым к любой другой сети.
</template>
<script>
  import { ref, onMounted } from 'vue'
  import { useRouter } from 'vue-router';

export default {
   name: 'ArticleDNS',
   setup(){
      const router = useRouter();
  
        function navigate(path, tren) {
          router.push({
            path: path, 
            params: {typeTren: tren}
            })
        }
  
  
  
      return {
        navigate
      }
     }
}

</script>
     